// Open close principle
/*
    Класи які ми створюєм повині бути відкриті для розширення, але закриті для модифікації.
    Ми повинні проектувати наші класи таким чином, щоб коли в нас появляться нові кейси(наприклад потреба дописати
    додатковий функціонал), ми не модифікували старий код, а він вже був спроектований таким чином, щоб коли ми
    дописували новий функціонал, ми не міняли старий фунціонал(код).
 */


class Square {
    constructor(size) {
        this.size = size
    }
}

class Circe {
    constructor(radius) {
        this.radius = radius
    }
}


console.log(new Circe(5));
